import numpy as np
import math

def hametsushiki(keypoints):
    """
    画像の座標から、首などの角度計算を行い、
    首が斜め45度傾いているならば、破滅フラグを立てる
    必要な座標は、
    0：鼻
    1：首
    2：右肩
    3：右肘
    4：右手首
    5：左肩
    6：左肘
    7：左手首
    8：臀部
    9：右尻
    10：右膝
    11：右足首
    12：右尻
    13：右膝
    14：右足首
    15：右目
    16：左目
    17：右耳
    18：左耳
    などなど
    実際に使うのは首から上なため、
    0,1,15,16,17,18
    の部位
    角度計算においては
    1をゼロ地点として、鼻と右目または右鼻の角度を見なければならない
    cos角度＝(鼻と胸の内積)/(鼻から胸の距離*鼻からの垂直距離)
    角度＝コサインの逆算

    計算し直し
    顔の向きだけで破滅を推定する
    """
    flag = False
    # A=np.array([abs(keypoints[0][0][0]-keypoints[0][1][0]), 
    #             abs(keypoints[0][1][1]-keypoints[0][0][1])])
    # B=np.array([abs(keypoints[0][0][0]-keypoints[0][1][0]), 
    #             abs(keypoints[0][1][1]-keypoints[0][1][1])])
    # print("Aのベクトル{}".format(A))
    # print("Bのベクトル{}".format(B))
    # hametsuCos=np.dot(A,B)/((A[0]**2+A[1]**2) * (B[0]**2+B[1]**2))
    # angle=math.acos(hametsuCos)
    # print("ABの内積{}".format(np.dot(A,B)))
    # print("A距離計算{}".format((A[0]**2+A[1]**2)))
    # print("B距離計算{}".format((B[0]**2+B[1]**2)))
    # print("cos値{}".format(hametsuCos))
    # print("角度計算{}度".format(angle))
    #角度計算
    nose = keypoints[0][0][:2]
    reye = keypoints[0][15][:2]
    leye = keypoints[0][16][:2]
    rear = keypoints[0][17][:2]
    lear = keypoints[0][18][:2]
    if np.mean(nose) == 0:
        flag = True
        return flag 
    else:
        if np.mean(reye) != 0:
            if reye[1] > nose[1]:
                flag = True
                return flag
        if np.mean(leye) != 0:
            if leye[1] > nose[1]:
                flag = True
                return flag
        # if np.mean(rear) != 0:
        #     if eye[1] > nose[1]:
        #         flag = True
        #         return flag
        # if np.mean(lear) != 0:
        #     if eye[1] > nose[1]:
        #         flag = True
        #         return flag
    return flag


if __name__ == "__main__":
    keypoints = np.array([[[2.4556352e+02, 2.0853870e+02, 6.3111997e-01],
        [2.9853714e+02, 1.6953912e+02, 6.9199659e-02],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [3.0655093e+02, 1.6153639e+02, 2.7423370e-01],
        [3.2755511e+02, 2.1056047e+02, 3.0178660e-01],
        [2.3053343e+02, 2.2253348e+02, 5.0006915e-02],
        [4.3355414e+02, 1.8453769e+02, 5.5938058e-02],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [4.3854129e+02, 1.6053702e+02, 6.3035659e-02],
        [4.9655243e+02, 1.8454874e+02, 6.4608239e-02],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [2.2854684e+02, 2.1254385e+02, 3.2741475e-01],
        [2.3955026e+02, 1.8752718e+02, 8.2542783e-01],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [2.5555492e+02, 1.5457047e+02, 8.1146026e-01],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00],
        [0.0000000e+00, 0.0000000e+00, 0.0000000e+00]]])
    hametsuFlag=hametsushiki(keypoints)
    print(hametsuFlag)